thockco/qmk/tmk_core/protocol/arm_atsam/usb/usb.c
static void _usb_device_interrupt_handler(void)
{
    uint16_t ep_inst;
    uint16_t flags, flags_run;
    ep_inst = _usb_instances->hw->DEVICE.EPINTSMRY.reg;

    /* device interrupt */
    if (0 == ep_inst) {
        int i;

        /* get interrupt flags */
        flags = _usb_instances->hw->DEVICE.INTFLAG.reg;
        flags_run = flags &
                _usb_instances->device_enabled_callback_mask &
                _usb_instances->device_registered_callback_mask;

        for (i = 0; i < USB_DEVICE_CALLBACK_N; i ++) {
            if (flags & _usb_device_irq_bits[i]) {
                _usb_instances->hw->DEVICE.INTFLAG.reg =
                        _usb_device_irq_bits[i];
            }
            if (flags_run & _usb_device_irq_bits[i]) {
                if (i == USB_DEVICE_CALLBACK_LPMSUSP) {
                    device_callback_lpm_wakeup_enable =
                            usb_descriptor_table.usb_endpoint_table[0].DeviceDescBank[0].EXTREG.bit.VARIABLE
                            & USB_LPM_ATTRIBUT_REMOTEWAKE_MASK;
                }
                (_usb_instances->device_callback[i])(_usb_instances, &device_callback_lpm_wakeup_enable);
            }
        }

    } else {
        /* endpoint interrupt */

        for (uint8_t i = 0; i < USB_EPT_NUM; i++) {

            if (ep_inst & (1 << i)) {
                flags = _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg;
                flags_run = flags &
                        _usb_instances->device_endpoint_enabled_callback_mask[i] &
                        _usb_instances->device_endpoint_registered_callback_mask[i];

                // endpoint transfer stall interrupt
                if (flags & USB_DEVICE_EPINTFLAG_STALL_Msk) {
                    if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_STALL1) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_STALL1;
                        ep_callback_para.endpoint_address = USB_EP_DIR_IN | i;
                    } else if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_STALL0) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_STALL0;
                        ep_callback_para.endpoint_address = USB_EP_DIR_OUT | i;
                    }

                    if (flags_run & USB_DEVICE_EPINTFLAG_STALL_Msk) {
                        (_usb_instances->device_endpoint_callback[i][USB_DEVICE_ENDPOINT_CALLBACK_STALL])(_usb_instances,&ep_callback_para);
                    }
                    return;
                }

                // endpoint received setup interrupt
                if (flags & USB_DEVICE_EPINTFLAG_RXSTP) {
                    _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_RXSTP;
                    if(_usb_instances->device_endpoint_enabled_callback_mask[i] & _usb_endpoint_irq_bits[USB_DEVICE_ENDPOINT_CALLBACK_RXSTP]) {
                        ep_callback_para.received_bytes = (uint16_t)(usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[0].PCKSIZE.bit.BYTE_COUNT);
                        (_usb_instances->device_endpoint_callback[i][USB_DEVICE_ENDPOINT_CALLBACK_RXSTP])(_usb_instances,&ep_callback_para);
                    }
                    return;
                }

                // endpoint transfer complete interrupt
                if (flags & USB_DEVICE_EPINTFLAG_TRCPT_Msk) {
                    if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRCPT1) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_TRCPT1;
                        ep_callback_para.endpoint_address = USB_EP_DIR_IN | i;
                        ep_callback_para.sent_bytes = (uint16_t)(usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[1].PCKSIZE.bit.BYTE_COUNT);

                    } else if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRCPT0) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_TRCPT0;
                        ep_callback_para.endpoint_address = USB_EP_DIR_OUT | i;
                        ep_callback_para.received_bytes = (uint16_t)(usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[0].PCKSIZE.bit.BYTE_COUNT);
                        ep_callback_para.out_buffer_size = (uint16_t)(usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[0].PCKSIZE.bit.MULTI_PACKET_SIZE);
                    }
                    if(flags_run & USB_DEVICE_EPINTFLAG_TRCPT_Msk) {
                        (_usb_instances->device_endpoint_callback[i][USB_DEVICE_ENDPOINT_CALLBACK_TRCPT])(_usb_instances,&ep_callback_para);
                    }
                    return;
                }

                // endpoint transfer fail interrupt
                if (flags & USB_DEVICE_EPINTFLAG_TRFAIL_Msk) {
                    if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRFAIL1) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_TRFAIL1;
                        if (usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[1].STATUS_BK.reg & USB_DEVICE_STATUS_BK_ERRORFLOW) {
                            usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[1].STATUS_BK.reg &= ~USB_DEVICE_STATUS_BK_ERRORFLOW;
                        }
                        ep_callback_para.endpoint_address = USB_EP_DIR_IN | i;
                        if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRCPT1) {
                            return;
                        }
                    } else if(_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRFAIL0) {
                        _usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg = USB_DEVICE_EPINTFLAG_TRFAIL0;
                        if (usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[0].STATUS_BK.reg & USB_DEVICE_STATUS_BK_ERRORFLOW) {
                            usb_descriptor_table.usb_endpoint_table[i].DeviceDescBank[0].STATUS_BK.reg &= ~USB_DEVICE_STATUS_BK_ERRORFLOW;
                        }
                        ep_callback_para.endpoint_address = USB_EP_DIR_OUT | i;
                        if (_usb_instances->hw->DEVICE.DeviceEndpoint[i].EPINTFLAG.reg & USB_DEVICE_EPINTFLAG_TRCPT0) {
                            return;
                        }
                    }

                    if(flags_run & USB_DEVICE_EPINTFLAG_TRFAIL_Msk) {
                        (_usb_instances->device_endpoint_callback[i][USB_DEVICE_ENDPOINT_CALLBACK_TRFAIL])(_usb_instances,&ep_callback_para);
                    }
                    return;
                }
            }
        }
    }
}

/**
 * \brief Enable the USB module peripheral
 *
 * \param module_inst pointer to USB module instance
 */
void usb_enable(struct usb_module *module_inst)
{
    Assert(module_inst);
    Assert(module_inst->hw);

